Revit 2026 API

# SchemaCommonUIName Property

---

The property labeled "UIName" common to all visual Asset types.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string UIName { get; }
```
```vb
Public Shared ReadOnly Property UIName As String
	Get
```
```cpp
public:
static property String^ UIName {
	String^ get ();
}
```
```fsharp
static member UIName : string with get
```

#### Property Value

String

This property is of type "AssetPropertyString".

#### Reference

SchemaCommon Class

Autodesk.Revit.DB.Visual Namespace